
/* --- 01 ---
Створити змінну і присвоїти їй функцію prompt() для отримання даних зі сторінки
- перетворити отримані дані в тип Number будь-яким зручним способом
- записати це в нову змінну
- вивести в консоль рядок типу '___ перетворилося на ___', де замість пропусків буде перша змінна та друга відповідно
- перетворити отримані дані в тип Boolean будь-яким зручним способом
- записати це в нову змінну
- вивести в консоль рядок типу '___ перетворилося на ___', де замість пропусків буде перша змінна та третя відповідно
Після виконання можна закоментувати код задачі, щоб не заважав виконувати наступне завдання.
*/

let input = prompt("чекаю: ");
let toNumber = Number(input);
console.log(`${input} перетворилася на ${toNumber}`);
let toBoolean = Boolean(input);
console.log(`${input} перетворилася на ${toBoolean}`);

/* --- 02 ---
Створити дві змінних, присвоїти їм функції prompt() для отримання даних зі сторінки.
- створити нову змінну і "склеїти" в неї дані зі змінних, отриманих з promptів 

В отриманих рядках до склеювання мають відбутися зміни - на місці першої літери слова/рядка має стояти остання у верхньому регістрі.

Наприклад: Замість окремих слів 'hello' і 'world' маємо отримати 'Dorld Oello' тощо.
- вивести цю змінну в консоль

Після виконання можна закоментувати код задачі, щоб не заважав виконувати наступне завдання.
*/

let input1 = prompt("чекаю #1: ");
let input2 = prompt("чекаю #2: ");
let input1Slice = input1.slice(-1).toUpperCase() + input1.slice(1);
let input2Slice = input2.slice(-1).toUpperCase() + input2.slice(1);
let inputSum = `${input1Slice} ${input2Slice}`;
console.log(inputSum);

/* --- 03 ---
Створити дві змінних, присвоїти їм функції prompt() для отримання даних зі сторінки. Дані мають конвертуватися в число на момент отримання.

- вивести в консоль повідомлення типу '__ плюс __ дорівнює __', де замість першого і другого пропуску мають бути дані, отримані з promptів, а замість останнього результат складання цих даних.

- вивести в консоль ще три різних повідомлення за аналогією на дії "мінус", "помножити" та "поділити"
*/

input1 = +prompt("чекаю #1: ", 0);
input2 = +prompt("чекаю #2: ", 0);
let sum = input1 + input2;
let dif = input1 - input2;
let mul = input1 * input2;
let div = input1 / input2;
console.log("Сума =", sum);
console.log("Різниця =", dif);
console.log("Добуток =", mul);
console.log("Частка =", div );