/* --- 01 ---
  Створити змінну let, яка зберігатиме вік користувача. 
  Присвоїти їй числове значення від 1 до 99. 
  Вивести змінну в консоль.
*/
let age = 99;
console.log (age);

/* --- 02 ---
  Присвоїти виществореній змінній інше значення - число від 1 до 99.
  Вивести цю змінну в консоль.
*/

age = 1;
console.log (age);

/* --- 03 ---
  Створити константу, яка зберігатиме дату народження у форматі ДД.ММ.РР. 
  Вивести цю дату за допомогою функції alert()
*/

const dob = '15.05.2003';
alert (dob);