/*Зверніть увагу! 
  Кожна з функції у цьому домашньому завданні має щось повертати. 
  Тож у тілі функції має бути return. 
  Не пишемо console.log у тілі функції. 
  Можна потім викликати функцію в console.log(functionName()), щоб побачити результат.  
*/

/* Вимоги до завдання:
- Код має бути відформатовано (використовуйте Prettier або альтернативні форматувальники)
- Назви змінних та функції мають відповідати загальним правилам неймінгу:
  - назви змінних повинні бути зрозумілими і описувати значення, яке в них зберігається;
  - для функції використовуйте описові імена, зазвичай дієслова в наказовому способі.
Поширеними префіксами є get, make, apply, check тощо...
*/

/* --- 01 ---
  Напишіть функцію, що прийматиме 2 параметри (літери, цифри або символи). Функція має повертати рядок типу
  abbb_abbb_abbb, де a - це перший з параметрів, b - другий з параметрів
  Приклад виклику createString('x', 'o') // xooo_xooo_xooo
  Використовуємо вкладені цикли.
  Підказка: щоб уникнути доклеювання останнього символа '_', можна використати умову та break
  Примітка. При виклику функції можна також вставляти emoji. Наприклад: createString('🚀', '🌌') або інші unicod-символи 
  createString('✂', '•')
*/
console.log("--- 01 ---");

function task1(params1, params2) {
  let str = "";
  for (let i = 0; i < 3; i++) {
    str = str + params1;
    for (let j = 0; j < 3; j++) {
      str = str + params2;
    }
    if (i == 2) {
      break;
    }
    str = str + "_";
  }
  return str;
}

console.log(task1("x", "o"));
/* --- 02 ---
  Напишіть функцію, що створюватиме фігури в консолі. 
  Функція прийматиме 2 параметри: перший - будь-який рядок-символ, другий - число. 
  Після виклику функція має відображати фігуру, відповідно до переданих аргументів.
  Наприклад: drawFigure('*', 5);
  1*
  1*2*
  1*2*3*
  1*2*3*4*
  1*2*3*4*5*
  Тобто число вказує на загальну кількість ліній у фігурі, а також обмежує максимальну кількість елементів. 
  Використати вкладені цикли.  
*/

console.log("--- 02 ---");

function task2(params1, params2) {
  let str = "";
  for (let i = 1; i <= params2; i++) {
    str += i;
    for (let j = 1; j <= i; j++) {
      str += params1;
    }
    str += "\n";
  }
  return str;
}

console.log(task2("*", 5));

/* --- 03 ---
  Напишіть функцію, що виводить в консоль подібні рядки:
  101010
  010101
  101010
  010101
  101010
  (Тут викликана функція з такими аргументами showLines(5, 6);)
  Тобто функція у якості параметрів приймає кількість рідків та кількість колонок і 
  виводить в консоль 0 та 1 в залежності від парності/непарності рядків та колонок. 
  Підказка: зверніть увагу, що коли залишки від ділення ітераторів тотожні, то виводиться 1, якщо ні, то 0
*/

console.log("--- 03 ---");

function task3(params1, params2) {
  let str = "";
  for (let i = 0; i < params1; i++) {
    const col = i % 2;
    for (let j = 0; j < params2; j++) {
      const line = j % 2;
      if (col == line) {
        str = str + "1";
      } else {
        str = str + "0";
      }
    }
    str += "\n";
  }
  return str;
}

console.log(task3(5, 6));

/* --- 04 --- 
  Написати функцію, що обчислює середнє значення кожного рядка у двовимірному масиві. Функція повертає масив з цими значеннями. 
  Масив для прикладу:
  [
    [1, 2, 3, 4],
    [4, 5, 6, 7],
    [7, 8, 9, 10],
    [12, 15, 20, 100]
  ]
*/

console.log("--- 04 ---");

let arr = [
  [1, 2, 3, 4],
  [4, 5, 6, 7],
  [7, 8, 9, 10],
  [12, 15, 20, 100],
];

function task4(arr) {
  let arr1 = [];
  for (let i = 0; i < arr.length; i++) {
    let sum = 0;
    for (let j = 0; j < arr[i].length; j++) {
      sum = sum + arr[i][j];
    }
    arr1.push(sum / arr[i].length);
  }
  return arr1;
}

console.log(task4(arr));

/* --- 05 --- 
Напишіть функцію, яка виводитиме в консоль рядки з числами, як у прикладі.
Функція має приймати будь-яке ціле число, що ділиться на 10 без залишку.

Приклад виклику функції: 
drawNums(50);
01_02_03_04_05_06_07_08_09_10
11_12_13_14_15_16_17_18_19_20
21_22_23_24_25_26_27_28_29_30
31_32_33_34_35_36_37_38_39_40
41_42_43_44_45_46_47_48_49_50
*/

console.log("--- 05 ---");

function task5(num) {
  let str = "";
  let num1 = num / 10;
  for (let i = 0; i < num1; i++) {
    for (let j = 1; j <= 10; j++) {
      if (j===10) {
        str = str + (i+1)*j + '\n';
      }
      else {
        str = str+`${i}`+`${j}_`;
      }
    }
  }
  return str;
}

console.log(task5(50));
