/* 
 Ви маєте рядок sentence з текстом 'Єхидна, ґава, їжак ще й шиплячі плазуни бігцем форсують Янцзи'. 
*/
const sentence = 'Єхидна, ґава, їжак ще й шиплячі плазуни бігцем форсують Янцзи';
/* Використовуючи методи рядків, виконайте наступні завдання: 
(Результати кожної дії виводимо в консоль)
*/
/* --- 01 ---
Замініть слово 'плазуни' на 'гризуни' та запишіть виправлене речення в нову змінну. 
*/
const sentencenew = sentence.replace("плазуни", "гризуни");
console.log (sentencenew);

/* --- 02 ---
Переведіть виправлений рядок в нижній регістр, запишіть це в нову змінну.
*/

const sentencelow = sentencenew.toLowerCase();
console.log (sentencelow);

/* --- 03 ---
Виріжте слово 'їжак' з рядка, запишіть виправлене речення в нову змінну. Має повертатися речення без слова 'їжак'. 
Використати метод slice()
*/

let sentencenot = sentence.slice(0, 13) + sentence.slice(18);
console.log (sentencenot);

/* --- 04 ---
Замініть кому перед словом 'ще' на порожнє місце.
*/

let sentencecoma =sentencenot.replace(', ще', " ще");
console.log (sentencecoma);

/* --- 05 ---
Знайдіть позицію слова 'бігцем'.
*/

const index = sentence.indexOf('бігцем');
console.log (index);

/* --- 06 ---
Склейте за допомогою метода concat() початкове речення та фразу 'бо більше нічого робить', запишіть це в нову змінну. 
*/

const longstr = sentence.concat('бо більше нічого робить');
console.log (longstr);