/* --- 01 ---
Створити змінну, яка буде зберігати число, введене з prompt.
Оголосити змінну для повідомлення. Не присвоювати їй значення.
Перевірити, чи число парне, чи ні.
Якщо парне, то змінній для повідомлення присвоїти значення 'число парне',
Якщо непарне, то повідомлення 'число непарне'. 
Вивести в консоль змінну з повідомленням

Розв'язати завдання двома способами: використовуючи if/else та використовуючи тернарний оператор
*/

let input = +prompt("Число :", 0);
let answer;
if (input % 2) {
  answer = "число непарне"
} else {
  answer = "число парне"
}
console.log(answer);
answer = (input % 2) ? "число непарне" : "число парне";
console.log(answer);

/* --- 02 ---
Створити змінну, яка буде зберігати рядок, введений з prompt
Оголосити змінну для повідомлення, не присвоювати їй значення
Зробити кілька перевірок:
  - Якщо рядок порожній - змінити текст повідомлення на 'Введіть текст заново'
  - Якщо довжина рядка більше 20 символів - змінити текст на 'Ви перевищили кількість символів у тексті'
  - Якщо довжина рядка менше 5 символів - змінити текст на 'Замало тексту'
В інших випадках - змінити текст повідомлення на введений текст
Змінну з повідомленням вивести в консоль

Розв'язати завдання, використовуючи if/else
*/

let inputStr = prompt("Слово :");
let answerStr;
if (!inputStr) {
  answerStr = "Введіть текст заново"
} else if (inputStr.length < 5) {
  answerStr = "Замало тексту"
} else if (inputStr.length > 20) {
  answerStr = "Ви перевищили кількість символів у тексті"
} else answerStr = inputStr;
console.log(answerStr);

/* --- 03 ---
Створити змінну, яка буде зберігати літеру, введену з prompt
У якості літер приймаються літери A, B, C, D, E, F
Перевіряти літери і виводити повідомлення відповідно до введеної літери:
  - Літера "А" - 'Відмінно'
  - Літера "B" - 'Добре'
  - Літера "C" - 'Задовільно'
  - Літера "D" - 'Непогано'
  - Літера "E" - 'Можна й краще'
  - Літера "F" - 'Це провал'
Якщо жодна з цих - 'Такої відмітки не існує'

Примітка: мають перевірятися саме літери у великому регістрі, тож можна заздалегідь застосувати необхідний метод

Розв'язати завдання, використовуючи switch/case
*/

let str = prompt("приймаються літери A, B, C, D, E, F або інші :");
let strUpper = str.toUpperCase();
let msg;
switch (strUpper) {
  case "A":
    msg = 'Відмінно'
    break;
  case "B":
    msg = 'Добре'
    break;
  case "C":
    msg = 'Задовільно'
    break;
  case "D":
    msg = 'Непогано'
    break;
  case "E":
    msg = 'Непогано'
    break;
  case "F":
    msg = 'Це провал'
    break;
  default:
    msg = 'Такої відмітки не існує'
    break;
}
console.log(`Літера "${strUpper}" -  ${msg}`);


/* --- 04 ---
Напишіть програму, яка приймає рядок від користувача за допомогою prompt та перевіряє, чи містить цей рядок літеру "a". 
Якщо містить, виведіть повідомлення 'Є така літера в рядку', якщо ні, виведіть повідомлення 'Ні, перевіряйте інший рядок'.

Розв'язати завдання, використовуючи будь-який спосіб на власний розсуд
*/

let line = prompt("Ваш текст: ");
let letter = line.includes("a");
let msgletter = (letter) ? 'Є така літера в рядку' : 'Ні, перевіряйте інший рядок';
console.log(msgletter);

/* --- 05 ---
Напишіть програму, яка приймає два числа від користувача за допомогою prompt та виводить результат їхнього додавання, якщо обидва числа є числами, і повідомлення 'Приймаються тільки числа', якщо хоча б одне з чисел не є числом.

Розв'язати завдання, використовуючи будь-який спосіб на власний розсуд
*/

let inputNumber1 = prompt("1: ");
let inputNumber2 = prompt("2: ");
let msginput;
if (inputNumber1 === inputNumber2) {
  msginput = inputNumber1 + inputNumber2
} else {
  msginput = "Приймаються тільки числа"
}
console.log(msginput);